performance/tests/serviceAccounts.yml
execution:
  - concurrency: 1
    hold-for: ${__P(scenario-duration,60)}
    scenario: service-account-create
  - concurrency: 1
    hold-for: ${__P(scenario-duration,60)}
    scenario: service-accounts-get-all
  - concurrency: 1
    hold-for: ${__P(scenario-duration,60)}
    scenario: service-account-delete-one

scenarios:
  get-user-token:
    requests:
    - if: '${__javaScript(vars.get("access_token") == null)}'
      then:
        - url: ${__P(base-uri)}/api/oauth/token
          method: POST
          label: GetUserToken
          headers:
            Authorization: Basic ${__base64Encode(${__P(user-auth)})}
          body:
            grant_type: password
            username: ${__P(username)}
            password: ${__P(password)}
          extract-jsonpath:
            access_token:
              jsonpath: $.access_token
  service-account-create:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/serviceAccounts
        method: POST
        label: CreateServiceAccount
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json
        extract-jsonpath:
          service_account_id: $.id
  service-account-delete-one:
    requests:
      - include-scenario: service-account-create
      - url: ${__P(base-uri)}/api/serviceAccounts/${service_account_id}
        method: DELETE
        label: DeleteServiceAccount
        headers:
          Authorization: Bearer ${access_token}
  service-accounts-get-all:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/serviceAccounts
        method: GET
        label: GetAllServiceAccounts
        headers:
          Authorization: Bearer ${access_token}
          Content-Type: application/json

reporting:
    - module: passfail
      criteria:
        Create Service Account too slow: p90 of CreateServiceAccount>500ms
        Delete Service Account too slow: p90 of DeleteServiceAccount>500ms
        Get All Service Accounts too slow: p90 of GetAllServiceAccounts>500ms