performance/tests/supervisoryNodes.yml
execution:
  - concurrency: ${__P(scenario-concurrency,10)}
    iterations: ${__P(scenario-iterations,10)}
    ramp-up: ${__P(scenario-ramp-up,1m)}
    hold-for: ${__P(scenario-duration,10m)}
    scenario: get-all-supervisory-nodes
  - concurrency: ${__P(scenario-concurrency,10)}
    iterations: ${__P(scenario-iterations,10)}
    ramp-up: ${__P(scenario-ramp-up,1m)}
    hold-for: ${__P(scenario-duration,10m)}
    scenario: get-page-of-ten-supervisory-nodes

scenarios:
  get-supervisory-node:
    # FP approval point
    variables:
      supervisory_node_id: fb38bd1c-beeb-4527-8345-900900329c10
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/supervisoryNodes/${supervisory_node_id}
        method: GET
        label: GetSupervisoryNode
        headers:
          Authorization: Bearer ${access_token}

  get-all-supervisory-nodes:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/supervisoryNodes
        method: GET
        label: GetAllSupervisoryNodes
        headers:
          Authorization: Bearer ${access_token}

  get-page-of-ten-supervisory-nodes:
    requests:
      - include-scenario: get-user-token
      - url: ${__P(base-uri)}/api/supervisoryNodes?page=0&size=10
        method: GET
        label: GetPageOfTenSupervisoryNodes
        headers:
          Authorization: Bearer ${access_token}

reporting:
  - module: passfail
    criteria:
      - 'GetAllSupervisoryNodes too high error rate: failures>1%, continue as failed, label=GetAllSupervisoryNodes, title="GetAllSupervisoryNodes error rate too high"'
      - 'GetAllSupervisoryNodes is too slow: p90>2500ms, stop as failed, label=GetAllSupervisoryNodes, title="GetAllSupervisoryNodes response time too high"'
      - 'GetAllSupervisoryNodes needs improvement: p90>1500ms and p90<=2500ms, continue as passed, label=GetAllSupervisoryNodes, title="GetAllSupervisoryNodes needs improvement"'
      - 'GetPageOfTenSupervisoryNodes too high error rate: failures>1%, continue as failed, label=GetPageOfTenSupervisoryNodes, title="GetPageOfTenSupervisoryNodes error rate too high"'
      - 'GetPageOfTenSupervisoryNodes is too slow: p90>2500ms, stop as failed, label=GetPageOfTenSupervisoryNodes, title="GetPageOfTenSupervisoryNodes response time too high"'
      - 'GetPageOfTenSupervisoryNodes needs improvement: p90>1500ms and p90<=2500ms, continue as passed, label=GetPageOfTenSupervisoryNodes, title="GetPageOfTenSupervisoryNodes needs improvement"'